no_dig_no_ride_app_api/app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes"
---
  def index
    @bikes = Bikes.all.reverse

INSERT INTO "bikes" ("brand", "size", "suspension", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["brand", "intense"], ["size", "xl"], ["suspension", "Rock Shox Lyrik 160mm"], ["created_at", "2020-07-10 04:59:08.141976"], ["updated_at", "2020-07-10 04:59:08.141976"]]
---
  def create
    @bike = Bikes.new(bike_params)

    if @bike.save

UPDATE "bikes" SET "brand" = $1, "suspension" = $2, "wheel_size" = $3, "updated_at" = $4 WHERE "bikes"."id" = $5  [["brand", "EVIL"], ["suspension", "ZEB"], ["wheel_size", "29"], ["updated_at", "2020-07-10 23:23:36.638618"], ["id", 2]]
---
  def update
    if @bike.update(bike_params)

DELETE FROM "bikes" WHERE "bikes"."id" = $1  [["id", 3]]
---
  def destroy
    @bike.destroy

SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_bike
      @bike = Bike.find(params[:id])